# Хакер Василий получил доступ к классному журналу и хочет заменить все свои минимальные оценки 
# на максимальные. 
# Напишите программу, которая заменяет оценки Василия, но наоборот: все максимальные – на минимальные.

# Input: 5
# # Output: 1 3 3 3 1

# def list(n):
#     list = [randint(1,5) for i in range(1,10)]

# def hack(n):
#     min_n = min(n)
#     max_n = max(n)
#     for i in range(len(n)):
#         if n[i] == max_n:
#             n[i] = min_n 
    
# m = int(input('Введите число M: ')) #Количество оценок в журнале
